<a href="https://colab.research.google.com/github/sureshmecad/CloudyML-AI-FOR-ALL/blob/main/6_Data_Cleaning_CloudyML.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# <center><u>Data Cleaning</u></center>

 * Data cleaning is a part of the process on a data science project.
 
* Data cleaning is the process of fixing or removing incorrect, corrupted, incorrectly formatted, duplicate, or incomplete data within a dataset.
<br>
* When you clean your data, all outdated or incorrect information is gone – leaving you with the highest quality information for your analysis and model building.

In [1]:
# import pandas and numpy with alias pd and np respectively
import numpy as np
import pandas as pd

* Create a dataframe, d1 = pd.DataFrame( {‘Temperature’ : [1, np.nan, 3, 2, 3] ,’Humidity’ : [22, np.nan, 2 , np.nan, 20 ] })

In [2]:
#create d1
d1 = pd.DataFrame( {'Temperature' : [1, np.nan, 3, 2, 3] , 'Humidity' : [22, np.nan, 2 , np.nan, 20 ] })

* print the dataframe d1

In [3]:
#print d1
d1

   Temperature  Humidity
0          1.0      22.0
1          NaN       NaN
2          3.0       2.0
3          2.0       NaN
4          3.0      20.0

* Find whether the given dataframe contain any missing values?

In [4]:
#check for null
d1.isnull()

   Temperature  Humidity
0        False     False
1         True      True
2        False     False
3        False      True
4        False     False

* How many missing values does each column have?

In [5]:
#total null
d1.isnull().sum()

Temperature    1
Humidity       2
dtype: int64

## Dealing with missing values


* Now, we know we have missing values, the next thing that we need to work on, is how to deal with these missing values

## Method 1: Delete the rows which contain missing values.
 * This method include dropping all the rows that have missing value in any column.

* Use a suitable method to drop all the rows having missing values and save the change in d2 variable

In [6]:
d2=d1.dropna()

* Print d2

In [7]:
#print nan
d2

   Temperature  Humidity
0          1.0      22.0
2          3.0       2.0
4          3.0      20.0

* Hey Remember : droping rows with nan is one of the method to deal with missing values. But you have to decide if you need to go for this method by checking percentage of nan present in the dataframe.

* If a column is having more than 60% of nan values then its better to remove such variables altogether if business permits

## Method 2: Replacing missing values
* Sometimes rather than dropping NA values, you'd rather replace them with a valid value. This value might be a single number like zero, or it might be some sort of imputation or interpolation

* Impute the missing values with constant number of your choice

In [8]:
# The below output has imputed missing  values with 100
d1.fillna(100)

   Temperature  Humidity
0          1.0      22.0
1        100.0     100.0
2          3.0       2.0
3          2.0     100.0
4          3.0      20.0

* Do you think its a  good way to treat Nan values? What if such constant values are not suitable for our further analysis?
Try to give your thoughts on this.

In [9]:
# Replacing with random number is not a good idea. In this case it will lead to outlier. It is always better to replace numerical values with median.

* Impute the missing values with mean

In [10]:
#  imputing mean
d1.fillna(d1.mean())

   Temperature   Humidity
0         1.00  22.000000
1         2.25  14.666667
2         3.00   2.000000
3         2.00  14.666667
4         3.00  20.000000

* Impute the missing values with median

In [11]:
#median imputing
d1.fillna(d1.median())

   Temperature  Humidity
0          1.0      22.0
1          2.5      20.0
2          3.0       2.0
3          2.0      20.0
4          3.0      20.0

* Replacing with the mean, mode or median approximations are a statistical approach of handling the missing values.

* Another Fun fact:
    
    This is an approximation which can add variance to the data set. But the loss of the data can be negated by this method which yields better results compared to removal of rows and columns.

* Impute Nan with forward fill

In [12]:
#forward fill
d1.fillna(method='ffill')

   Temperature  Humidity
0          1.0      22.0
1          1.0      22.0
2          3.0       2.0
3          2.0       2.0
4          3.0      20.0

* Impute Nan with backward fill

In [13]:
#backward fill
d1.fillna(method='bfill')

   Temperature  Humidity
0          1.0      22.0
1          3.0       2.0
2          3.0       2.0
3          2.0      20.0
4          3.0      20.0

* Hey a fun fact here, as sweet as a cookie:

    - ffill/pad/bfill are good imputation method if our data is of time series. This would keep the trend unaffected for our analysis.

* Impute nan using interpolation method

In [14]:
#interpolate
d1.interpolate(method ='linear', limit_direction ='forward')

   Temperature  Humidity
0          1.0      22.0
1          2.0      12.0
2          3.0       2.0
3          2.0      11.0
4          3.0      20.0

* You lucky champ! you got to know another amazing fact:
    - Interpolation method by default is linear in nature. It is an imputation technique that assumes a linear relationship between data points and utilises non-missing values from adjacent data points to compute a value for a missing data point.
    - You can explore other techniques involved in interplolation method, which might be usefull for your project.

# Dropping Irrelevant Columns

* Create a dataframe df = pd.DataFrame(np.random.randint(0,100,size=(100, 5)), columns=list('ABCDE'))

In [16]:
np.random.seed(10)

df = pd.DataFrame(np.random.randint(0,100,size=(100, 5)), columns=list('ABCDE'))

* print df

In [17]:
print (df)

     A   B   C   D   E
0    9  15  64  28  89
1   93  29   8  73   0
2   40  36  16  11  54
3   88  62  33  72  78
4   49  51  54  77  69
..  ..  ..  ..  ..  ..
95   3  50  59  34  21
96  16  18  61  54  60
97  21  87  83  71  16
98  67  38  27  96  87
99  98  89  16  82  19

[100 rows x 5 columns]

* Note: Since all the rows are having random numbers, your dataframe observations might be different than the output given above

* Suppose for our analysis our project do not require column E. So you need to remove this column. update this new change using inplace parameter

In [18]:
#drop E
df.drop(["E"], axis=1, inplace=True)

* Check if column **E** is removed by printing head of df

In [19]:
#df head
df.head()

    A   B   C   D
0   9  15  64  28
1  93  29   8  73
2  40  36  16  11
3  88  62  33  72
4  49  51  54  77

# Ensure requirements as per domain


* Shallow copy the dataframe df in variable df2 and print df2 head

In [20]:
df2=df.copy()

#df2 head
df2.head()

    A   B   C   D
0   9  15  64  28
1  93  29   8  73
2  40  36  16  11
3  88  62  33  72
4  49  51  54  77

* Suppose your domain expert says to filter column B with even numbers to do correct analysis. Implement the same below and update the change in varaible df2.

In [21]:
df2 = df2[df2['B'] % 2 == 0]

* print updated head of *df2*

In [22]:
# df2 head
df2.head()

     A   B   C   D
2   40  36  16  11
3   88  62  33  72
6   30  30  89  12
9   11  28  74  88
10  15  18  80  71

# Creating a sensible index values

* Oops. The index in this dataframe doesn't make sense. please correct index in a sequential manner starting from 1. Save the updates in df2

In [23]:
#set proper index
df2 = df2.reset_index(drop=True)

* print df2 head again

In [24]:
# df2 head
df2.head()

    A   B   C   D
0  40  36  16  11
1  88  62  33  72
2  30  30  89  12
3  11  28  74  88
4  15  18  80  71

# Renaming column names to meaningful names.

* Now df2 columns represents marks of the adventurous 'Anand', the brave 'Barkha', the compassionate 'Chandu' and the dashing 'Daniel'. Rename the columns with their name inplace of their first letter of their name.

In [25]:
#column renaming
df2 = df2.rename(columns={'A': 'Anand', 'B': 'Barkha', 'C': 'Chandu', 'D': 'Daniel'})

* print df2 tail with updated column names

In [26]:
# df2 head
df2.head()

   Anand  Barkha  Chandu  Daniel
0     40      36      16      11
1     88      62      33      72
2     30      30      89      12
3     11      28      74      88
4     15      18      80      71

* Yeah! now the data looks pretty meaningful to study

# Treating Duplicate Data

* Make another dataframe df3 by deep copying df2.

In [27]:
df3= df2.copy()

* Make another column in df3 with name 'dummy' having 0 as values
throughout the rows.

In [28]:
#assign dummy column full of zero value
df3['dummy'] = 0

In [29]:
# print head of df, df2 and df3
print(df.head())
print(df2.head())
print(df3.head())

    A   B   C   D
0   9  15  64  28
1  93  29   8  73
2  40  36  16  11
3  88  62  33  72
4  49  51  54  77
   Anand  Barkha  Chandu  Daniel
0     40      36      16      11
1     88      62      33      72
2     30      30      89      12
3     11      28      74      88
4     15      18      80      71
   Anand  Barkha  Chandu  Daniel  dummy
0     40      36      16      11      0
1     88      62      33      72      0
2     30      30      89      12      0
3     11      28      74      88      0
4     15      18      80      71      0

* Hey buddy! Don't you think, there is some difference between copy operation used for creating df2 and df3.

* print tail of df3

In [31]:
# df3 tail
df3.tail()

    Anand  Barkha  Chandu  Daniel  dummy
43      1      82      34      11      0
44     74      36       6      63      0
45      3      50      59      34      0
46     16      18      61      54      0
47     67      38      27      96      0

* make an array name 'ListB' with values of column 'Barkha'

In [32]:
ListB= df3['Barkha'].values

* Print ListB

In [33]:
#print ListB
ListB

array([36, 62, 30, 28, 18, 50, 88, 50, 80, 66, 96, 30,  4, 30,  2, 42, 94,
       18, 44, 68, 58, 48, 70, 22, 36, 32, 32, 96, 30, 86,  0, 76, 88, 64,
       52, 46, 20, 66, 56,  8, 68, 50, 28, 82, 36, 50, 18, 38])

* Assign this array values as another column in df3 with name 'Anonymous'

In [34]:
#create Anonymous column
df3['Anonymous'] = pd.DataFrame(ListB)

* Create a dataframe 'ListA' with values of row index 3, 10 and 40

In [35]:
ListA= df3.iloc[[3,10,40],]

* print ListA

In [36]:
# print ListA
ListA

    Anand  Barkha  Chandu  Daniel  dummy  Anonymous
3      11      28      74      88      0         28
10     88      96      73      40      0         96
40     87      68      86      14      0         68

* Concat ListA to df3 ignoring the index values of ListA so that we can maintain the sequential index value thoughout the dataframe.

In [37]:
df3= pd.concat([ListA, df3], axis=0, ignore_index=True)

* print head of df3

In [38]:
# df3 head
df3.head()

   Anand  Barkha  Chandu  Daniel  dummy  Anonymous
0     11      28      74      88      0         28
1     88      96      73      40      0         96
2     87      68      86      14      0         68
3     40      36      16      11      0         36
4     88      62      33      72      0         62

* Check if there is any duplicate rows present in the dataframe df3

In [39]:
#check duplicate
df3.duplicated().sum()

3

* By above output it seems we do have duplicated rows in our dataset

* Drop duplicated rows using pandas function keeping first values of such duplicated observations

In [40]:
#drop duplicate
df3.drop_duplicates(keep = False, inplace = True)

* Check again if we have any duplicate row values present

In [41]:
#check duplicate
df3.duplicated().sum()

0

* Yipeee!! Did you notice the dataframe is free from any duplicate rows now.

* Drop any duplicate columns present in the dataframe df

In [42]:
df3= df3.T.drop_duplicates().T

#print df3
df3.head()

   Anand  Barkha  Chandu  Daniel  dummy
3     40      36      16      11      0
4     88      62      33      72      0
5     30      30      89      12      0
7     15      18      80      71      0
8     88      50      54      34      0

* Did you notice which Column is dropped?
I am sure you noticed it.
Name that column below

In [43]:
#Column: Anonymous_______

# Treating constant column values

Check unique values in each columns

In [44]:
# df3 unique value
df3.nunique()

Anand     40
Barkha    32
Chandu    38
Daniel    35
dummy      1
dtype: int64

* By above output which column has only 1 value as unique throught the rows? 
Yeah! you are right, its dummy column.
So lets drop it

* Drop dummy column as it has constant values which will not give us any information and save the changes to df3 using inplace parameter

In [45]:
# drop dummy
df3.drop('dummy', axis=1, inplace=True)

* print final obtained dataframe df3

In [46]:
# print df3
df3.head()

   Anand  Barkha  Chandu  Daniel
3     40      36      16      11
4     88      62      33      72
5     30      30      89      12
7     15      18      80      71
8     88      50      54      34

# Iterating dataframes
<p style='text-align: right;'> 25 points </p>

Let's look at three main ways to iterate over DataFrames.

1. iteritems()
2. iterrows()
3. itertuples()

We will also see time taken by these methods to print our dataframe. 

**1. Iterating DataFrames with iteritems()**

Lets iterate over rows of df3 uisng iteritems.

In [47]:
import time
start = time.time()

#Use iteritems to iterate
for label, content in df3.items():
    print(f'label: {label}')
    print(f'content: {content}', sep='\n')


print('Time taken(sec): ',(time.time()-start)*1000)

label: Anand
content: 3     40
4     88
5     30
7     15
8     88
9     77
10    97
11    81
12    96
14    28
15    33
16    68
17     9
18    62
19    32
20    45
21     6
22    44
23    39
24    69
25     5
26     4
27    10
28    85
29    31
30     0
31     2
32    63
33    19
34    58
35     7
36    27
37    27
38    99
39    84
40    77
41    82
42    74
44    50
45     1
46     1
47    74
48     3
49    16
50    67
Name: Anand, dtype: int64
label: Barkha
content: 3     36
4     62
5     30
7     18
8     50
9     88
10    50
11    80
12    66
14    30
15     4
16    30
17     2
18    42
19    94
20    18
21    44
22    68
23    58
24    48
25    70
26    22
27    36
28    32
29    32
30    96
31    30
32    86
33     0
34    76
35    88
36    64
37    52
38    46
39    20
40    66
41    56
42     8
44    50
45    28
46    82
47    36
48    50
49    18
50    38
Name: Barkha, dtype: int64
label: Chandu
content: 3     16
4     33
5     89
7     80
8     54
9     15
10    45
11    41
12    67
14    89
15    87
16    70
17    65
18    34
19    86
20    50
21     9
22    14
23    81
24    60
25    61
26    19
27     0
28    81
29    96
30    25
31    17
32    29
33     7
34    10
35    96
36    49
37    90
38    46
39    49
40    37
41    41
42    92
44    85
45    58
46    34
47     6
48    59
49    61
50    27
Name: Chandu, dtype: int64
label: Daniel
content: 3     11
4     72
5     12
7     71
8     34
9      6
10    40
11    90
12    62
14    25
15    94
16    74
17    13
18    40
19    58
20    44
21    50
22     4
23    39
24    58
25    16
26    85
27    30
28    13
29    38
30    63
31    59
32    71
33    93
34    79
35    38
36    90
37    57
38    45
39    33
40    31
41    90
42    32
44    14
45    10
46    11
47    63
48    34
49    54
50    96
Name: Daniel, dtype: int64
Time taken(sec):  4.713773727416992

Did you notice buddy how iteritems are iterating over df3.

Along with ways each iterating function works, also keep tallying the time taken for all other lopps too!. This will be fun, lets check iterrows()

**2. Iterating DataFrames with iterrows()**

In [48]:
import time
start = time.time()
#Use iterrows to iterate
for i, row in df3.iterrows():
	print(f"Index: {i}")
	print(f"{row}\n")
 
print('Time taken(sec): ',(time.time()-start)*1000)

Index: 3
Anand     40
Barkha    36
Chandu    16
Daniel    11
Name: 3, dtype: int64

Index: 4
Anand     88
Barkha    62
Chandu    33
Daniel    72
Name: 4, dtype: int64

Index: 5
Anand     30
Barkha    30
Chandu    89
Daniel    12
Name: 5, dtype: int64

Index: 7
Anand     15
Barkha    18
Chandu    80
Daniel    71
Name: 7, dtype: int64

Index: 8
Anand     88
Barkha    50
Chandu    54
Daniel    34
Name: 8, dtype: int64

Index: 9
Anand     77
Barkha    88
Chandu    15
Daniel     6
Name: 9, dtype: int64

Index: 10
Anand     97
Barkha    50
Chandu    45
Daniel    40
Name: 10, dtype: int64

Index: 11
Anand     81
Barkha    80
Chandu    41
Daniel    90
Name: 11, dtype: int64

Index: 12
Anand     96
Barkha    66
Chandu    67
Daniel    62
Name: 12, dtype: int64

Index: 14
Anand     28
Barkha    30
Chandu    89
Daniel    25
Name: 14, dtype: int64

Index: 15
Anand     33
Barkha     4
Chandu    87
Daniel    94
Name: 15, dtype: int64

Index: 16
Anand     68
Barkha    30
Chandu    70
Daniel    74
Name: 16, dtype: int64

Index: 17
Anand      9
Barkha     2
Chandu    65
Daniel    13
Name: 17, dtype: int64

Index: 18
Anand     62
Barkha    42
Chandu    34
Daniel    40
Name: 18, dtype: int64

Index: 19
Anand     32
Barkha    94
Chandu    86
Daniel    58
Name: 19, dtype: int64

Index: 20
Anand     45
Barkha    18
Chandu    50
Daniel    44
Name: 20, dtype: int64

Index: 21
Anand      6
Barkha    44
Chandu     9
Daniel    50
Name: 21, dtype: int64

Index: 22
Anand     44
Barkha    68
Chandu    14
Daniel     4
Name: 22, dtype: int64

Index: 23
Anand     39
Barkha    58
Chandu    81
Daniel    39
Name: 23, dtype: int64

Index: 24
Anand     69
Barkha    48
Chandu    60
Daniel    58
Name: 24, dtype: int64

Index: 25
Anand      5
Barkha    70
Chandu    61
Daniel    16
Name: 25, dtype: int64

Index: 26
Anand      4
Barkha    22
Chandu    19
Daniel    85
Name: 26, dtype: int64

Index: 27
Anand     10
Barkha    36
Chandu     0
Daniel    30
Name: 27, dtype: int64

Index: 28
Anand     85
Barkha    32
Chandu    81
Daniel    13
Name: 28, dtype: int64

Index: 29
Anand     31
Barkha    32
Chandu    96
Daniel    38
Name: 29, dtype: int64

Index: 30
Anand      0
Barkha    96
Chandu    25
Daniel    63
Name: 30, dtype: int64

Index: 31
Anand      2
Barkha    30
Chandu    17
Daniel    59
Name: 31, dtype: int64

Index: 32
Anand     63
Barkha    86
Chandu    29
Daniel    71
Name: 32, dtype: int64

Index: 33
Anand     19
Barkha     0
Chandu     7
Daniel    93
Name: 33, dtype: int64

Index: 34
Anand     58
Barkha    76
Chandu    10
Daniel    79
Name: 34, dtype: int64

Index: 35
Anand      7
Barkha    88
Chandu    96
Daniel    38
Name: 35, dtype: int64

Index: 36
Anand     27
Barkha    64
Chandu    49
Daniel    90
Name: 36, dtype: int64

Index: 37
Anand     27
Barkha    52
Chandu    90
Daniel    57
Name: 37, dtype: int64

Index: 38
Anand     99
Barkha    46
Chandu    46
Daniel    45
Name: 38, dtype: int64

Index: 39
Anand     84
Barkha    20
Chandu    49
Daniel    33
Name: 39, dtype: int64

Index: 40
Anand     77
Barkha    66
Chandu    37
Daniel    31
Name: 40, dtype: int64

Index: 41
Anand     82
Barkha    56
Chandu    41
Daniel    90
Name: 41, dtype: int64

Index: 42
Anand     74
Barkha     8
Chandu    92
Daniel    32
Name: 42, dtype: int64

Index: 44
Anand     50
Barkha    50
Chandu    85
Daniel    14
Name: 44, dtype: int64

Index: 45
Anand      1
Barkha    28
Chandu    58
Daniel    10
Name: 45, dtype: int64

Index: 46
Anand      1
Barkha    82
Chandu    34
Daniel    11
Name: 46, dtype: int64

Index: 47
Anand     74
Barkha    36
Chandu     6
Daniel    63
Name: 47, dtype: int64

Index: 48
Anand      3
Barkha    50
Chandu    59
Daniel    34
Name: 48, dtype: int64

Index: 49
Anand     16
Barkha    18
Chandu    61
Daniel    54
Name: 49, dtype: int64

Index: 50
Anand     67
Barkha    38
Chandu    27
Daniel    96
Name: 50, dtype: int64

Time taken(sec):  36.740779876708984

**3. Iterating DataFrames with itertuples()**

In [49]:
#iterate df3 using itertuples
import time
start = time.time()

#Use itertuples to iterate
for row in df3.itertuples():
    print(row)

print('Time taken(sec): ',(time.time()-start)*1000)

Pandas(Index=3, Anand=40, Barkha=36, Chandu=16, Daniel=11)
Pandas(Index=4, Anand=88, Barkha=62, Chandu=33, Daniel=72)
Pandas(Index=5, Anand=30, Barkha=30, Chandu=89, Daniel=12)
Pandas(Index=7, Anand=15, Barkha=18, Chandu=80, Daniel=71)
Pandas(Index=8, Anand=88, Barkha=50, Chandu=54, Daniel=34)
Pandas(Index=9, Anand=77, Barkha=88, Chandu=15, Daniel=6)
Pandas(Index=10, Anand=97, Barkha=50, Chandu=45, Daniel=40)
Pandas(Index=11, Anand=81, Barkha=80, Chandu=41, Daniel=90)
Pandas(Index=12, Anand=96, Barkha=66, Chandu=67, Daniel=62)
Pandas(Index=14, Anand=28, Barkha=30, Chandu=89, Daniel=25)
Pandas(Index=15, Anand=33, Barkha=4, Chandu=87, Daniel=94)
Pandas(Index=16, Anand=68, Barkha=30, Chandu=70, Daniel=74)
Pandas(Index=17, Anand=9, Barkha=2, Chandu=65, Daniel=13)
Pandas(Index=18, Anand=62, Barkha=42, Chandu=34, Daniel=40)
Pandas(Index=19, Anand=32, Barkha=94, Chandu=86, Daniel=58)
Pandas(Index=20, Anand=45, Barkha=18, Chandu=50, Daniel=44)
Pandas(Index=21, Anand=6, Barkha=44, Chandu=9, Daniel=50)
Pandas(Index=22, Anand=44, Barkha=68, Chandu=14, Daniel=4)
Pandas(Index=23, Anand=39, Barkha=58, Chandu=81, Daniel=39)
Pandas(Index=24, Anand=69, Barkha=48, Chandu=60, Daniel=58)
Pandas(Index=25, Anand=5, Barkha=70, Chandu=61, Daniel=16)
Pandas(Index=26, Anand=4, Barkha=22, Chandu=19, Daniel=85)
Pandas(Index=27, Anand=10, Barkha=36, Chandu=0, Daniel=30)
Pandas(Index=28, Anand=85, Barkha=32, Chandu=81, Daniel=13)
Pandas(Index=29, Anand=31, Barkha=32, Chandu=96, Daniel=38)
Pandas(Index=30, Anand=0, Barkha=96, Chandu=25, Daniel=63)
Pandas(Index=31, Anand=2, Barkha=30, Chandu=17, Daniel=59)
Pandas(Index=32, Anand=63, Barkha=86, Chandu=29, Daniel=71)
Pandas(Index=33, Anand=19, Barkha=0, Chandu=7, Daniel=93)
Pandas(Index=34, Anand=58, Barkha=76, Chandu=10, Daniel=79)
Pandas(Index=35, Anand=7, Barkha=88, Chandu=96, Daniel=38)
Pandas(Index=36, Anand=27, Barkha=64, Chandu=49, Daniel=90)
Pandas(Index=37, Anand=27, Barkha=52, Chandu=90, Daniel=57)
Pandas(Index=38, Anand=99, Barkha=46, Chandu=46, Daniel=45)
Pandas(Index=39, Anand=84, Barkha=20, Chandu=49, Daniel=33)
Pandas(Index=40, Anand=77, Barkha=66, Chandu=37, Daniel=31)
Pandas(Index=41, Anand=82, Barkha=56, Chandu=41, Daniel=90)
Pandas(Index=42, Anand=74, Barkha=8, Chandu=92, Daniel=32)
Pandas(Index=44, Anand=50, Barkha=50, Chandu=85, Daniel=14)
Pandas(Index=45, Anand=1, Barkha=28, Chandu=58, Daniel=10)
Pandas(Index=46, Anand=1, Barkha=82, Chandu=34, Daniel=11)
Pandas(Index=47, Anand=74, Barkha=36, Chandu=6, Daniel=63)
Pandas(Index=48, Anand=3, Barkha=50, Chandu=59, Daniel=34)
Pandas(Index=49, Anand=16, Barkha=18, Chandu=61, Daniel=54)
Pandas(Index=50, Anand=67, Barkha=38, Chandu=27, Daniel=96)
Time taken(sec):  2.294301986694336

Hey buddy! so as you have seen every method works differently 
    
    iteritems(): Helps to iterate over each element of the set, column-wise. 
    iterrows(): Each element of the set, row-wise. 
    itertuple(): Each row and form a tuple out of them.

But if you ask for speed. The most best perfromance is given by itertuples compared to other two iterating methods.
So if anytime you need to save your computation time on iteration of dataframes you can go for itertuples. Was'nt it fun?:)